#### Terraform Plan 📖 `infrastructure/aws`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_db_subnet_group.branch_rds_subnet_group: Refreshing state... [id=branch-rds-subnet-group]
data.infisical_secrets.rds_folder: Reading...
data.infisical_secrets.rds_folder: Read complete after 1s
aws_db_instance.branch_rds: Refreshing state... [id=db-AMMYFTORW6XJGRELV7WQZCNHQI]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_db_subnet_group.branch_rds_subnet_group will be destroyed
  # (because aws_db_subnet_group.branch_rds_subnet_group is not in configuration)
  - resource "aws_db_subnet_group" "branch_rds_subnet_group" {
      - arn                     = "arn:aws:rds:us-east-2:489881683177:subgrp:branch-rds-subnet-group" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "branch-rds-subnet-group" -> null
      - name                    = "branch-rds-subnet-group" -> null
      - region                  = "us-east-2" -> null
      - subnet_ids              = [
          - "subnet-01ba5fb7d1d668836",
          - "subnet-047a2da9edb096ac3",
          - "subnet-0c90814f2cc07dd18",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name" = "branch-rds-subnet-group"
        } -> null
      - tags_all                = {
          - "Name" = "branch-rds-subnet-group"
        } -> null
      - vpc_id                  = "vpc-0a9ccfb59c8918ce9" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.reports_bucket will be created
  + resource "aws_s3_bucket" "reports_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "c4c-branch-generated-reports"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - rds_endpoint = "terraform-20251009192006341800000001.cexlbyrdcxre.us-east-2.rds.amazonaws.com:5432" -> null
  - rds_port     = 5432 -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @nourshoreibah, Action: `pull_request`*